scripts/global/1608/32881775

<p>I need help generating XML SOAP message in PHP. I'm using BeSimpleSoap extension. I've tried many different ways to generate SOAP message.  Message should look like this:</p>  <pre><code>&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://apis-it.hr/umu/2015/types/kp" xmlns:gsb="http://apis-it.hr/umu/2013/types/gsb"&gt;    &lt;soapenv:Header/&gt;    &lt;soapenv:Body&gt;       &lt;gsb:SendMessageRequest&gt;          &lt;gsb:GsbEnvelope&gt;             &lt;gsb:MessageHeader&gt;                &lt;gsb:SenderId&gt;1&lt;/gsb:SenderId&gt;                &lt;gsb:ServiceId&gt;126&lt;/gsb:ServiceId&gt;                &lt;gsb:MessageId&gt;c4413331-1cff-11e2-f516-242d656ac4b3&lt;/gsb:MessageId&gt;                &lt;gsb:SenderTimeStamp&gt;2015-05-31T12:00:00&lt;/gsb:SenderTimeStamp&gt;             &lt;/gsb:MessageHeader&gt;             &lt;gsb:Content&gt;                &lt;gsb:MimeType&gt;aaa&lt;/gsb:MimeType&gt;                &lt;gsb:Data encoding="EMBEDDED"&gt;                      &lt;tns:Upit&gt;                         &lt;tns:IdPosiljatelja&gt;1&lt;/tns:IdPosiljatelja&gt;                         &lt;tns:TipPoruke&gt;1&lt;/tns:TipPoruke&gt;                         &lt;tns:IdUpita&gt;732262f1-063f-11e2-892e-0812200c9f68&lt;/tns:IdUpita&gt;                         &lt;tns:DatumVrijemeUpita&gt;2015-03-26T15:33:29.371+01:00&lt;/tns:DatumVrijemeUpita&gt;                      &lt;/tns:Upit&gt;                &lt;/gsb:Data&gt;             &lt;/gsb:Content&gt;          &lt;/gsb:GsbEnvelope&gt;       &lt;/gsb:SendMessageRequest&gt;    &lt;/soapenv:Body&gt; &lt;/soapenv:Envelope&gt; </code></pre>  <p>I have tried to generat XML with this:</p>  <pre><code>$encodded = new SoapVar("&lt;tns:Upit&gt;                                 &lt;tns:IdPosiljatelja&gt;196&lt;/tns:IdPosiljatelja&gt;                                 &lt;tns:TipPoruke&gt;$TipPoruke&lt;/tns:TipPoruke&gt;                                 &lt;tns:IdUpita&gt;$UUID&lt;/tns:IdUpita&gt;                                 &lt;tns:DatumVrijemeUpita&gt;$date_time&lt;/tns:DatumVrijemeUpita&gt;                             &lt;/tns:Upit&gt;", XSD_ANYXML);       $par_envelope=array( "GsbEnvelope" =&gt;           array( "MessageHeader" =&gt;              array("SenderId" =&gt; "24",                 "ServiceId" =&gt; "$ServiceId",                 "MessageId" =&gt; $UUID,                 "SenderTimeStamp" =&gt; $date_time),                 "Content" =&gt; array("MimeType" =&gt;"application/xml","Data" =&gt;array("any"=&gt;$encodded,"encoding"=&gt;"EMBEDDED"))));      $par_WSDL=array("trace"=&gt;TRUE,         "exceptions"=&gt;TRUE,         'location'=&gt;$SERVICE_TEST,         "local_cert" =&gt;$SOAP_cert,         'uri'=&gt;$NAMESPACE_URI,         "passphrase"=&gt;$cert_password,         "connection_timeout" =&gt; 60);      $client = new BeSimple\SoapClientSoapClient("GSBService.wsdl",$par_WSDL);      $result=$client-&gt;sendMessage($par_envelope); </code></pre>  <p>But that only generated part of a XML message that looks like:</p>  <pre><code>&lt;?xml version="1.0" encoding="UTF-8"?&gt; &lt;SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://apis-it.hr/umu/2013/types/gsb"&gt;     &lt;SOAP-ENV:Body&gt;         &lt;ns1:SendMessageRequest&gt;             &lt;ns1:GsbEnvelope&gt;                 &lt;ns1:MessageHeader&gt;                     &lt;ns1:SenderId&gt;1&lt;/ns1:SenderId&gt;                     &lt;ns1:ServiceId&gt;1&lt;/ns1:ServiceId&gt;                     &lt;ns1:MessageId&gt;34578b73-988a-4727-bee4-a287218cc0a1&lt;/ns1:MessageId&gt;                     &lt;ns1:SenderTimeStamp&gt;2015-10-01T09:07:25+02:00&lt;/ns1:SenderTimeStamp&gt;                 &lt;/ns1:MessageHeader&gt;                 &lt;ns1:Content&gt;                     &lt;ns1:MimeType&gt;application/xml&lt;/ns1:MimeType&gt;                     &lt;ns1:Data/&gt;                 &lt;/ns1:Content&gt;             &lt;/ns1:GsbEnvelope&gt;         &lt;/ns1:SendMessageRequest&gt;     &lt;/SOAP-ENV:Body&gt; &lt;/SOAP-ENV:Envelope&gt;  </code></pre>  <p>EDIT <a href="https://drive.google.com/file/d/0B5nEOQOUuhptdUlNbkE2VE5kbzg/view?usp=sharing" rel="nofollow">Here</a> you can see WSDL and XSD files. </p>